update_deal.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:erec="http://erecharge.sixdee.com">
	<soapenv:Header/>
	<soapenv:Body>
		<erec:register>
			<UpdateDealerProfileRequest>
				<WSUsername>sixdee</WSUsername>
				<WSPassword>sixdee</WSPassword>
				<ExternalTxnId>798406547710657312375152262528</ExternalTxnId>
				<RequestTime>2023-12-30 14:13:23.658779</RequestTime>
				<Channel>WEB</Channel>
				<SenderUserId>1</SenderUserId>
				<UserDetails>
					<FirstName>dealer_non_trusted</FirstName>
					<LastName>dealer_non_trusted</LastName>
					<Level>Dealer</Level>
					<Profile>Dealer</Profile>
					<Area>INDIA</Area>
					<Status>true</Status>
					<Msisdn>95154421</Msisdn>
					<AlernateContactNo/>
					<Language>E</Language>
					<UserType>P</UserType>
					<WalletType>D</WalletType>
					<ERPCode/>
					<ServiceProvider>None</ServiceProvider>
					<StartTime>2023-12-30</StartTime>
					<ParentId>50015159</ParentId>
					<IsNotify>true</IsNotify>
					<IMEI>false</IMEI>
					<SalesmanCode>false</SalesmanCode>
					<paymentType>CASH</paymentType>
					<paymentTerms>false</paymentTerms>
					<aliasName>dealer_non_trusted</aliasName>
					<operatorType>1</operatorType>
					<notificationEmail/>
					<crNumber>123874</crNumber>
					<AddressDetails>
						<AddressLine1>MUSCAT</AddressLine1>
						<AddressLine2/>
						<City/>
						<State/>
						<Locality/>
						<Zip/>
					</AddressDetails>
					<LoginDetails>
						<UserName>DST0017</UserName>
						<IsPinDisabled>false</IsPinDisabled>
						<IsStaticPinEnabled>false</IsStaticPinEnabled>
					</LoginDetails>
					<AccountDetails>
						<Account>
							<AccountId>0</AccountId>
							<AccountType>3</AccountType>
							<WalletType>D</WalletType>
							<SaleLimit>0.0</SaleLimit>
							<SalesUsage>0.0</SalesUsage>
							<AccountBalance>0.0</AccountBalance>
							<SaleLimitAlertValue>0.0</SaleLimitAlertValue>
							<DailyLimit>0.0</DailyLimit>
							<WeeklyLimit>0.0</WeeklyLimit>
							<MonthlyLimit>0.0</MonthlyLimit>
						</Account>
					</AccountDetails>
					<ListAvailableChannels>
						<AvailableChannels>sales_app</AvailableChannels>
					</ListAvailableChannels>
					<ListAvailableProducts/>
				</UserDetails>
			</UpdateDealerProfileRequest>
		</erec:register>
	</soapenv:Body>
</soapenv:Envelope>